Autodesk.Revit.DB.View3D.GetSectionBox
Get a copy of the section box.
Remarks:
The section box cuts the model by the bounds of the box. To turn off section box, pass in null or a disabled box. Individual bound enabled flags are currently ignored.
Returns:
The section box.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.SetSectionBox(Autodesk.Revit.DB.BoundingBoxXYZ)
Sets the section box.
boundingBoxXYZ:
The bounding box to use for the section box.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Bounding box cannot be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.IsSectionBoxActive
Identifies whether or not the section box is active.
True if the section box is active, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.IsPerspective
Identifies whether this is a perspective view.
Remarks:
In a perspective view, view direction is variable - it is the direction that connects a particular point on the model with the eye position. The view direction property becomes less meaningful - it only describes the general orientation of the camera.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.